<?php

namespace App\Management\Functions;

/**
 * 各種書類のアップロード
 */
class DocumentUpdate
{
    /**
     * main
     *
     * @return bool
     */
    public function main(): bool
    {
        // ファイルアップロード画面が必要
        //      「ファイルダイアログ」を表示するボタンが必要
        //      ファイルをドラッグアンドドロップで選択することが出来る
        //      アップロードするファイルの種類を選択出来る
        //      コメントを入力することが出できる
        //      選択したファイルを削除することができる
        //      関係者にメールを送信する機能が必要
        //      アップロードボタンが必要
        //      ファイル一覧から書類をダウンロード出来るボタンが必要
        //      ファイル履歴から書類をダウンロード出来るボタンが必要

        return false;
    }
}
